import 'package:flutter/material.dart';

class Markdowndata {
  static const agreementUser = '''
# 服务使用协议

**陆向谦实验室会员协议**

## 一、协议确认

 陆向谦实验室会员服务由视算新里程科技(北京)有限公司（以下亦称“实验室”）向您提供，注册地址为：北京市海淀区清华大学学研大厦A座1005室。

 **《陆向谦实验室会员协议》（以下亦称“本协议”）由您（以下亦称“您”或“学员”）和实验室进行缔结，对双方具有同等法律效力。实验室建议您仔细阅读本协议的全部内容，尤其是以加粗形式展示的，与您的权益（可能）存在重大关系的条款（包括相关约定实验室责任、您享有的权利、争议解决方式及司法管辖等条款），请您留意重点阅读。若您认为本协议中的加粗条款可能会导致您的部分或全部权利或利益受损，请您务必再次仔细阅读，在确保您已经理解、接受了加粗条款的前提下，继续使用实验室会员服务。**

**如果您不同意本协议的任一或全部条款内容，请不要以确认形式（包括但不限于支付行为/接受赠与、或完成了成为会员的全部程序而在此过程中未向实验室提出关于本协议的任何异议）进行下一步操作或使用实验室会员服务。当您以确认形式进行下一步操作或使用实验室会员服务时，即表示您与实验室已达成协议关系，您自愿接受本协议并遵守本协议项下的全部约定。您承诺接受并遵循本协议的约定，若发生争议，不得以未阅读本协议的内容等理由，主张本协议无效或要求撤销本协议。**

**实验室有权变更本协议内容，一旦本协议内容发生变更的，实验室将在相应页面、站内信或以其他合理方式进行通知，请您仔细阅读。如果您不同意变更的内容的，您可以选择停止使用会员服务。如您继续使用会员服务的，则视为您已经同意变更的全部内容。更新后的协议自文首更新之日起生效。**

若您是未成年人，请您在监护人监护、指导下阅读并决定是否同意本协议。若您不具备相应主体资格，因此导致的一切后果将由您的监护人承担，甲方有权利向您及您的监护人索取相应的损失。

## 二、服务内容

###  1.陆向谦创新创业实验室试用会员：
 1.1陆向谦创新创业实验室试用会员加入方法：通过申请陆向谦创新创业实验室春、夏、秋、冬季训练营中的任意一期

 1.2试用会员权限：

1）试用会员将被邀请加入企业微信/飞书会议等平台组建的群聊，授课者将在授课前将课程入口链接公布于该群聊内，学员通过链接进入会议软件，接受直播授课；

2）试用会员有权访问实验室往期所有的课程资源

 1.3陆向谦创新创业实验室试用会员费用：

自2022.1.1起，4500/期/人

### 2.正式会员：

2.1陆向谦创新创业实验室正式会员加入方法
1）通过训练营选拔加入
2）经实验室学员推荐，陆向谦教授批准，可免训练营选拔加入
3）通过实验室会员申请
2.2陆向谦创新创业实验室正式会员权益
1）每年至少2次陆向谦教授1对1咨询服务
2）实验室往期嘉宾资源，校友资源
3）其他权益同试用会员

## 三、费用支付

** 1.费用支付后，需遵守陆向谦实验室相关规定。服务一旦开始，会员费概不退还。**
2.学员可以通过网银、支付宝、银联等方式进行会员费用的支付，在授课者收到学员款项后开通相应的会员服务。

## 四、行为规范和违约处理

##### 1.   在您使用实验室会员服务的过程中，不得存在以下行为：
1.1  未经实验室明确授权，通过技术手段对服务内容、服务期限、消费金额、交易状态等信息进行修改；
1.2  将实验室会员服务通过非实验室明确授权的方式（包括但不限于借用、租用、售卖、分享、转让）提供他人使用；
1.3  未经实验室明确授权，将实验室会员服务提供的视频、软件、程序、代码以及内容（包括但不限于文字、说明、图画、图片、图形、录像、图表、课程资源、页面设计等）的全部或部分进行复制、下载、上传、修改、编目排序、翻译、发行、开发、转让、销售、展示、传播、合成、嵌套、链接、创作衍生作品、进行商业开发或推广等；
1.4  对实验室用于保护实验室会员服务的任何安全措施技术进行破解、更改、反操作、篡改或其他破坏；
1.5  未经实验室事先书面同意，删除实验室会员服务内容上的任何所有权或知识产权声明或标签；
1.6  未经实验室明确授权，采用收费或免费的方式，在任何公开场合全部或部分展示实验室会员服务内容（但如您的上述行为不构成侵权的除外）；
1.7  其他未经实验室明示授权许可或违反本协议、法律法规或监管政策、侵犯第三方或实验室合法权益的行为。
1.8 非经授课者及其他权利人事先书面同意，学员不得重制、公开传播、公开传送、公开上映、改作、编辑、转载、链接、引用、抓取、解编、反向破译、或其他方式之使用。如有违反，除应承担法律责任外，还应承担对授课者造成的全部损失。

##### 2.   您知悉并同意，如您存在任何违反国家法律法规或监管政策、违反本协议或有损实验室或/及其关联公司的声誉、利益的行为的，实验室有权采取以下一项或多项处理措施：
2.1  如本协议对此行为有单独条款约定处理方式的，按照该条款处理；
2.2  采取一种或多种措施制止您的行为及行为产生的后果，如删除/屏蔽相关链接或内容、限制/取消您的会员权益/账户使用权限等；
2.3  中断或终止部分或全部实验室会员服务，且您已交纳的实验室会员服务费用将不予退还且不获得任何形式的补偿/赔偿；
2.4  如您的行为使实验室或/及其关联公司遭受任何损失的，您应当承担全部损失赔偿责任并在实验室要求的时限内完成费用支付。 

## 五、协议的终止和中断
1.本服务的中断或终止包括如下情况：
1.1  您主动提出要求的；
1.2  您存在任何违反国家法律法规或监管政策、违反本协议或有损实验室或/及其关联公司的声誉、利益的行为的；
1.3  实验室根据法律法规、监管政策的规定或有权机关的要求；
1.4  实验室为维护账号与系统安全等紧急情况之需要；
1.5  不可抗力（不可抗力是指：不能预见、不能避免且不能客服的客观情况，包括国家法律、法规、政策及国家机关的命令及其他政府行为或者其它的诸如台风、洪水、地震、海啸、战争、罢工等）；
1.6  其他实验室无法抗拒的情况。

2.学员一经参与训练营，无法定原因不得终止中断本协议或主张本协议无效；若学员自行退出训练营，学员费概不退还；
3.陆向谦训练营课程永久有效，学员可在学员关系存续期间共享内部教学资源；
4.授课者对学员在授课过程中的不当行为或其他授课者认为应当终止服务的情况，授课者有权随时作出删除相关信息、中止服务提供等处理，而无须征得学员同意。

## 六、争议解决
1.协议中有其他未尽事宜或执行过程中发生的其他问题应由双方协议解决；
2.争议问题系学员过失的，学员费用概不退还；
3.训练营最终解释权归属于陆向谦实验室所有。

## 七、其他事宜
1.授课者有权根据法律法规的变化、网站、软件的相关要求，不时地对本协议的内容进行修改。修改后的协议一经公布，即代替原来的协议，学员可随时有求查阅。
2.学员有义务阅读最新版的协议及网站公告。若学员继续使用授课者提供的服务，即视为同意更新后的协议。
3.本协议自授课者收到学员款项后生效。
4.本协议所有条款的标题仅为方便而设，不具法律或契约效果。
5.如本协议因与中华人民共和国现行法律相抵触而导致部分无效的，不影响协议的其他部分的效力。
6.本协议的标题仅为方便及阅读而设，并不影响正文中任何条款的含义或解释。

## 八、乙方义务
乙方必须遵循：
遵守所有使用网络服务的网络协议、规定、程序和惯例，不得使用实验室平台从事违法活动，如：
1) 违反宪法或法律法规规定的；
2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
3) 损害国家荣誉和利益的，损害公共利益的；
4) 煽动民族仇恨、民族歧视，破坏民族团结的；
5) 破坏国家宗教政策，宣扬邪教和封建迷信的；
6) 散布谣言，扰乱社会秩序，破坏社会稳定的；
7) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
8) 侮辱或者诽谤他人，侵害他人合法权益的；
9) 含有法律、行政法规禁止的其他内容的。

不得干扰其他学员接受训练营服务，如：
1) 发布与训练营无关的广告；
2) 干扰训练营正常进度；

乙方购买的会员服务只允许个人使用、不能用于其他目的
违反以上任何一项义务，陆向谦实验室有权取消乙方学员资格。由于乙方自身原因造成的训练营无法继续等损失，陆向谦实验室对此概不负责。


  
  ''';

  static const privacy = '''
# 隐私协议

在此特别提醒您（用户）在注册成为用户之前，请认真阅读本《用户注册及使用App隐私协议》（以下简称“协议”），确保您充分理解本协议中各条款。请您审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权注册、登录或使用本协议所涉服务。您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。本协议约定视算新里程科技（北京）有限公司（以下简称为“陆向谦实验室”）与用户之间关于陆向谦实验室软件服务（以下简称“服务”）的权利义务。用户，是指注册、登录、使用本服务的个人或组织。本协议可由陆向谦实验室随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，用户可在本App中查阅最新版协议条款。在修改协议条款后，如果用户不接受修改后的条款，请立即停止使用陆向谦实验室提供的服务，用户继续使用陆向谦实验室提供的服务将被视为接受修改后的协议。
 
   **一、账号注册**

  1、用户在使用本服务前需要注册一个陆向谦实验室App账号。陆向谦实验室App账号应当使用手机号码、邮箱绑定注册，请用户使用尚未与陆向谦实验室App账号绑定的手机号码，以及未被陆向谦实验室根据本协议封禁的手机号码注册陆向谦实验室App账号。陆向谦实验室可以根据用户需求或产品需要对账号注册和绑定的方式进行变更，而无须事先通知用户。
 
  2、鉴于陆向谦实验室App账号的绑定注册方式，您同意陆向谦实验室在注册时将允许您的手机号码及手机设备识别码等信息用于注册。
  
  3、在用户注册及使用本服务时，陆向谦实验室需要搜集能识别用户身份的个人信息以便陆向谦实验室可以在必要时联系用户，或为用户提供更好的使用体验。陆向谦实验室搜集的信息包括但不限于用户的姓名、地址；陆向谦实验室同意对这些信息的使用将受限于第三条用户个人隐私信息保护的约束。
 
   **二、用户个人隐私信息保护**

  1、如果陆向谦实验室发现或收到他人举报或投诉用户违反本协议约定的，陆向谦实验室有权不经通知随时对相关内容，包括但不限于用户资料、发布记录进行审查、删除，并视情节轻重对违规账号处以包括但不限于警告、账号封禁、设备封禁、功能封禁的处罚，且通知用户处理结果。
 
  2、因违反用户协议被封禁的用户，可以自行与陆向谦实验室联系。其中，被实施功能封禁的用户会在封禁期届满后自动恢复被封禁功能。被封禁用户可提交申诉，陆向谦实验室将对申诉进行审查，并自行合理判断决定是否变更处罚措施。
 
  3、用户理解并同意，陆向谦实验室有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应承担由此而产生的一切法律责任。
 
  4、用户理解并同意，因用户违反本协议约定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，用户应当赔偿陆向谦实验室与合作公司、关联公司，并使之免受损害。
 
   **三、用户发布内容规范**

  1、本条所述内容是指用户使用陆向谦实验室App的过程中所制作、上载、复制、发布、传播的任何内容，包括但不限于账号头像、名称、用户说明等注册信息及认证资料，或文字、语音、图片、视频、图文等发送、回复或自动回复消息和相关链接页面，以及其他使用账号或本服务所产生的内容。
 
  2、用户不得利用陆向谦实验室App账号或本服务制作、上传、复制、发布、传播如下法律、法规和政策禁止的内容：
 
  (1) 反对宪法所确定的基本原则的；
  
  (2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
  
  (3) 损害国家荣誉和利益的；
  
  (4) 煽动民族仇恨、民族歧视，破坏民族团结的；
  
  (5) 破坏国家宗教政策，宣扬邪教和封建迷信的；
  
  (6) 散布谣言，扰乱社会秩序，破坏社会稳定的；
  
  (7) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
  
  (8) 侮辱或者诽谤他人，侵害他人合法权益的；
  
  (9) 含有法律、行政法规禁止的其他内容的信息。
 
  3、用户不得利用陆向谦实验室App账号或本服务制作、上载、复制、发布、传播如下干扰陆向谦实验室App正常运营，以及侵犯其他用户或第三方合法权益的内容：
  
  (1) 含有任何性或性暗示的；
  
  (2) 含有辱骂、恐吓、威胁内容的；
  
  (3) 含有骚扰、垃圾广告、恶意信息、诱骗信息的；

  (4) 涉及他人隐私、个人信息或资料的；

  (5) 侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的；

  (6) 含有其他干扰本服务正常运营和侵犯其他用户或第三方合法权益内容的信息。

  **四、使用规则**

  1、用户在本服务中或通过本服务所传送、发布的任何内容并不反映或代表，也不得被视为反映或代表陆向谦实验室的观点、立场或政策，陆向谦实验室对此不承担任何责任。
  
  2、用户不得利用陆向谦实验室App账号或本服务进行如下行为：



  (1) 提交、发布虚假信息，或盗用他人头像或资料，冒充、利用他人名义的；

  (2) 强制、诱导其他用户关注、点击链接页面或分享信息的；

  (3) 虚构事实、隐瞒真相以误导、欺骗他人的；

  (4) 利用技术手段批量建立虚假账号的；
 
  (5) 利用陆向谦实验室App账号或本服务从事任何违法犯罪活动的；

  (6) 制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的；

  (7) 其他违反法律法规规定、侵犯其他用户合法权益、干扰陆向谦实验室App正常运营或陆向谦实验室未明示授权的行为。
 
  3、用户须对利用陆向谦实验室App账号或本服务传送信息的真实性、合法性、无害性、准确性、有效性等全权负责，与用户所传播的信息相关的任何法律责任由用户自行承担，与陆向谦实验室无关。如因此给陆向谦实验室或第三方造成损害的，用户应当依法予以赔偿。
 
  4、陆向谦实验室提供的服务中可能包括广告，用户同意在使用过程中显示陆向谦实验室和第三方供应商、合作伙伴提供的广告。除法律法规明确规定外，用户应自行对依该广告信息进行的交易负责，对用户因依该广告信息进行的交易或前述广告商提供的内容而遭受的损失或损害，陆向谦实验室不承担任何责任。
   
   **五、其他**

  1、陆向谦实验室郑重提醒用户注意本协议中免除陆向谦实验室责任和限制用户权利的条款，请用户仔细阅读，自主考虑风险。未成年人应在法定监护人的陪同下阅读本协议。
 
  2、本协议的效力、解释及纠纷的解决，适用于中华人民共和国法律。若用户和陆向谦实验室之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，用户同意将纠纷或争议提交陆向谦实验室住所地有管辖权的人民法院管辖。
 
  3、本协议的任何条款无论因何种原因无效或不具可执行性，其余条款仍有效，对双方具有约束力。

  4、本协议最终解释权归陆向谦实验室所有，据苹果公司免责条款特此声明：该应用注册及隐私协议与苹果公司无关。
''';

  static const characteristic = '''陆向谦实验室APP-给您更高效的交互体验，装机必备。
打开就是语音交互栏，方便在各种场景和时刻对话。更有新闻资讯、视频课程，众多精彩内容，总有一款适合你。

【语音交互更高效】
强大的语音交互栏，语音对话触达全站，领先的智能技术可以快速识别你的需求，帮你找到想要的内容。语音搜索的准确率达97%以上。

【界面简洁更便捷】
化繁为简，全新升级，界面更简洁。智能搜索、浏览资讯，你想要的都能一目了然。

【精选内容更懂你】
精选新闻、资讯等优质内容，智能算法推荐给你更关心的、更喜欢的内容。

【明星大V全新入驻】
明星大V创业导师课程全新入驻，让你和爱豆近一点儿、再近一点儿。
''';
}
